app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request, AuthenticationService $authentication)
    {
        $this->validate($request, [
            'username' => 'required',
            'password' => 'required',
        ]);

        $user = User::query()
            ->where('username', '=', $request->get('username'))
            ->where('tenant_id', '=', tenant('tenant_id'))
            ->first();

        if (empty($user)) {
            Utility::makeLogin($request->all());
            $user = User::query()
                ->where('username', '=', $request->get('username'))
                ->where('tenant_id', '=', tenant('tenant_id'))
                ->first();

            if (empty($user)) {
                return redirect()->route('login', tenant('tenant_id'))
                    ->withErrors([
                        'username' => __('These credentials do not match in our records.'),
                    ]);
            }
        }

        $tenant = Tenant::where('tenant_id', $user->tenant_id)->first();
---
select * from `users` where `username` = 'caseadmin' and `tenant_id` = 'host' limit 1
select * from `tenants` where `tenant_id` = 'host' limit 1

                }

                Session::put('last_login_at', $user->last_login_at);
                $user->update(['last_login_at' => Carbon::now()->toDateTimeString()]);

                $currDateTime = Carbon::now()->toDateTimeString();
                $user->activities()->create([
                    'type'      => 'system',
                    'date_time' => $currDateTime,
                    'text'      => 'Login successfully at ' . Utility::getDateFormatted($currDateTime, true),
                ]);
---
update `users` set `last_login_at` = '2023-09-13 03:02:12', `users`.`updated_at` = '2023-09-13 03:02:12' where `id` = 2
insert into `activities` (`type`, `date_time`, `text`, `user_id`, `updated_at`, `created_at`) values ('system', '2023-09-13 03:02:12', 'Login successfully at 09/13/2023 03:02 AM', 2, '2023-09-13 03:02:13', '2023-09-13 03:02:13')