app/Http/Controllers/HomeController.php

            if (count($arrLayouts) > 0) {
                if (in_array($objUser->layout_definition, array_keys($arrLayouts))) {
                    $firstLayout      = $objUser->layout_definition;
                    $layoutDefinition = LayoutDefinition::find($objUser->layout_definition);
---
select * from `layout_definitions` where `layout_definitions`.`id` = 1 limit 1

                    $objUser->save();
                }

                $responseArr['top'] = $layoutDefinition->layouts()
                    ->where('position', 'LIKE', 'top')
                    ->orderBy('order_no', 'ASC')
                    ->get();

                $customHtmlTitles =  $this->findNeedleHaystackArray('title', 'content_type', "Custom HTML", $responseArr['top'], $customHtmlTitles);

                $responseArr['middle'] = $layoutDefinition->layouts()
                    ->where('position', 'LIKE', 'middle')
                    ->orderBy('order_no', 'ASC')
                    ->get();

                $customHtmlTitles =  $this->findNeedleHaystackArray('title', 'content_type', "Custom HTML", $responseArr['middle'], $customHtmlTitles);

                $responseArr['bottom'] = $layoutDefinition->layouts()
                    ->where('position', 'LIKE', 'bottom')
                    ->orderBy('order_no', 'ASC')
                    ->get();
---
select * from `layouts` where `layouts`.`layout_definition_id` = 1 and `layouts`.`layout_definition_id` is not null and `position` LIKE 'top' order by `order_no` asc
select * from `layouts` where `layouts`.`layout_definition_id` = 1 and `layouts`.`layout_definition_id` is not null and `position` LIKE 'middle' order by `order_no` asc
select * from `layouts` where `layouts`.`layout_definition_id` = 1 and `layouts`.`layout_definition_id` is not null and `position` LIKE 'bottom' order by `order_no` asc