app/Http/Controllers/SettingsController.php

select * from `module_permission_assignments`
---
    public function index() {

        $usrData         = Session::get('userInfo');
        $userGroups      = $usrData->UserGroups ?? [];
        $permsAssignment = ModulePermissionAssignment::all();

select * from `faqs`
select * from `tenants`
---

            unset($arrMessage['installer_messages']);

            $faqs    = Faq::all();
            $tenants = Tenant::all();

select * from `layout_definitions` order by `user_group` asc
---


            $layoutDefinitions             = [];
            $layoutDefinitions['all']      = LayoutDefinition::orderBy('user_group')->get();

select * from `rest_integrations` where (`integration_type` = 1 and `parent_id` = 0)
select * from `custom_pages`
---
            $layoutDefinitions['external'] = LayoutDefinition::where('user_group', '=', 2)->get()->pluck('title', 'id');
            //$layoutDefinitions['public']   = LayoutDefinition::where('user_group', '=', 3)->get()->pluck('title', 'id');

            $integrations = RestIntegration::where(['integration_type' => 1, 'parent_id' => 0])->get();

            $customPage = CustomPage::all();

select `module_name` from `module_permission_defs`
select * from `module_permission_defs` where `module_name` = 'Calendar'
select * from `mail_settings` limit 1
---
            sort($securityGroup);

            $modulePermsDefs = [];
            $permsModuleName = ModulePermissionDef::pluck('module_name')->unique();
            $search          = [' ', '&']; //for str_replace

            foreach ($permsModuleName as $module_name) {
                $modulePermsDefs[$module_name]['results'] = ModulePermissionDef::where('module_name', '=', $module_name)->get();
                $modulePermsDefs[$module_name]['code']    = str_replace($search, '_', strtolower(trim($module_name)));
            }

            $mail = MailSetting::first();