app/Http/Controllers/UserController.php

    public function userList(Request $request)
    {
        if ($request->ajax() && $request->has('sort')) {
            $sort  = explode('-', $request->sort);
            $users = User::orderBy($sort[0], $sort[1]);

            if (!empty($request->tenant_id) && user()->account_type == 1) {
                $users->where('tenant_id', '=', $request->tenant_id);
            } elseif (user()->account_type == 4) {
                $users->where('tenant_id', '=', tenant('tenant_id'));
            }

            if (!empty($request->keyword)) {
                $users->where('name', 'LIKE', '%' . $request->keyword . '%');
            }

            $users      = $users->get();
---
select * from `users` where `tenant_id` = 'host' order by `created_at` desc