packages/engage/ilinxengage_qapp/src/Http/Controllers/QappController.php

insert into `qapp_definitions` (`tenant_id`, `name`, `description`, `updated_at`, `created_at`) values ('host', 'Teat', 'Database Reset', '2023-09-13 05:15:30', '2023-09-13 05:15:30')
---
    public function storeQapp(Request $request ) {

        $qapp = new QappDefinition;
        $qapp->tenant_id = \Auth::user()->tenant_id;
        $qapp->name = $request->title;
        $qapp->description = $request->description;
        $qapp->save();

select * from `qapp_definitions` where `tenant_id` = 'host' and `id` = '1' limit 1
---
    public function edit($id) {
        $qapp = QappDefinition::where('tenant_id', \Auth::user()->tenant_id)->where('id', $id)->first();

select * from `qapp_definitions` where `tenant_id` = 'host' and `id` = '1' limit 1
update `qapp_definitions` set `form_json` = '[{\"type\":\"text\",\"required\":false,\"label\":\"Text Field\",\"className\":\"form-control\",\"name\":\"text\",\"access\":false,\"subtype\":\"text\"}]', `qapp_definitions`.`updated_at` = '2023-09-13 04:01:08' where `id` = 1
---



        $qapp = QappDefinition::where('tenant_id', \Auth::user()->tenant_id)->where('id', $request->qappId)->first();
        $qapp->form_json = $request->json;
        $qapp->save();

select * from `qapp_definitions` where `qapp_definitions`.`id` = '1' limit 1
delete from `qapp_definitions` where `id` = 1
---
    public function destroy($id){
        $qapp = QappDefinition::find($id);
        $qapp->delete();