app/Models/LayoutDefinition.php

select * from `layout_definitions` where `user_group` = 1
---
    public static function layoutDefinitions()
    {
        $objUser    = user();
        $usrData    = Session::get('userInfo');
        $userGroups = $usrData->UserGroups ?? '';

        $userGroup = self::getUserGroupByAccountType($objUser->account_type);

        $definitions = LayoutDefinition::query()
            ->where('user_group', '=', $userGroup)
            ->get();