app/Models/ModulePermissionAssignment.php

select * from `module_permission_assignments`
---
    public static function userPermissions()
    {

        $usrData    = Session::get('userInfo');
        $userGroups      = $usrData->UserGroups ?? [];

        // Checking the settings level on user permissions
        $permsAssignment = ModulePermissionAssignment::all();