app/Models/Navigation.php

select * from `layout_definitions` where `layout_definitions`.`id` = 1 limit 1
select * from `navigations` where `layout_definition_id` = 1 order by `order_no` asc
---
    private static function getLayoutDefinition(User $user): Collection
    {
        $layoutDefinitionId = 0;
        $arrLayouts         = LayoutDefinition::layoutDefinitions()->toArray();

        if (count($arrLayouts) > 0) {
            if (in_array($user->layout_definition, array_keys($arrLayouts))) {
                $layoutDefinition = LayoutDefinition::find($user->layout_definition);
            } else {
                $layoutDefinition = LayoutDefinition::find(array_keys($arrLayouts)[0]);
            }

            $layoutDefinitionId = $layoutDefinition->id;
        }

        $navigation = Navigation::where('layout_definition_id', '=', $layoutDefinitionId);

        return $navigation->orderBy('order_no', 'ASC')->get();