app/Models/User.php

    public function getUnreadNotification()
    {
        if ($this->notifications_read) {
            $notifications = UserNotification::where('created_at', '>', $this->notifications_read)
                ->where(function (Builder $query) {
                    return $query->orWhere(function (Builder $q1) {
                        return $q1->where('username', $this->username)
                            ->where('tenant_id', $this->tenant_id)
                            ->where('scope', 'user');
                    })
                        ->orWhere(function (Builder $q2) {
                            return $q2->where('tenant_id', $this->tenant_id)
                                ->where('scope', 'tenant');
                        })
                        ->orWhere(function (Builder $q3) {
                            return $q3->where('scope', 'system');
                        });
                })
                ->orderBy('created_at', 'DESC')
                ->get();
---
select * from `user_notifications` where `created_at` > '2023-09-11 07:46:40' and ((`username` = 'caseadmin' and `tenant_id` = 'host' and `scope` = 'user') or (`tenant_id` = 'host' and `scope` = 'tenant') or (`scope` = 'system')) order by `created_at` desc