app/Models/Utility.php

    public static function settings(): array
    {
        // $tenantOwner = tenant()?->getUserOwner() ?? [];

        $data = DB::table('settings')->get();
---
select * from `settings`

        if (in_array($key, $tenant_props)) {
            // Ensure we have a logged-in user
            if (!empty(user())) {
                $tenant = Tenant::where('tenant_id', user()->tenant_id)->first();
---
select * from `tenants` where `tenant_id` = 'host' limit 1

                return $tenant[$key] ?? '';
            } else {
                // Default to the host settings
                $tenant = Tenant::where('tenant_id', 'host')->first();
---
select * from `tenants` where `tenant_id` = 'host' limit 1